In [1]:
import numpy as np 
import pandas as pd
from pandas import Series,DataFrame

In [3]:
df = DataFrame

In [7]:
dframe1 = df(np.arange(8).reshape(2,4),
            index=pd.Index(['in','ussr'],name='country'),
            columns = pd.Index(['A','B','C','D'],name='letters'))
dframe1

letters  A  B  C  D
country
in       0  1  2  3
ussr     4  5  6  7

In [11]:
dframe_st = dframe1.stack()
dframe_st

country  letters
in       A          0
         B          1
         C          2
         D          3
ussr     A          4
         B          5
         C          6
         D          7
dtype: int32

In [15]:
# to turn back to dataframe
dframe_st.unstack()

letters  A  B  C  D
country
in       0  1  2  3
ussr     4  5  6  7

In [17]:
dframe_st.unstack('country')

country  in  ussr
letters
A         0     4
B         1     5
C         2     6
D         3     7

In [25]:
ser1 = Series([0,1,2],index=['Q','X','Y'])
ser2 = Series([4,5,6],index=['X','Y','Z'])

In [27]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Sigma'])

dframe

Alpha  Q    0
       X    1
       Y    2
Sigma  X    4
       Y    5
       Z    6
dtype: int64

In [29]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Sigma  NaN  4.0  5.0  6.0

In [31]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Sigma  X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [37]:
dframe = dframe.unstack()
dframe

   Alpha  Sigma
Q    0.0    NaN
X    1.0    4.0
Y    2.0    5.0
Z    NaN    6.0

In [45]:
dframe.stack(dropna=False)

C:\Users\kodur\AppData\Local\Temp\ipykernel_9620\2313729354.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  dframe.stack(dropna=False)

Q  Alpha    0.0
   Sigma    NaN
X  Alpha    1.0
   Sigma    4.0
Y  Alpha    2.0
   Sigma    5.0
Z  Alpha    NaN
   Sigma    6.0
dtype: float64